app/Actions/Fortify/CreateNewUser.php

insert into `users` (`name`, `username`, `email`, `password`, `updated_at`, `created_at`) values ('Haider Ali', 'haiderali', 'haiderkhalid602@gmail.com', '$2y$10$qwMlcHcXwQXJoYymZ/Lme.nRtzMDs3batpkMhO0MWzToiYo8F3kCW', '2023-02-05 21:31:02', '2023-02-05 21:31:02')
---
    public function create(array $input)
    {
        Validator::make($input, [
            'name' => ['required', 'string', 'max:255'],
            'email' => ['required', 'string', 'email', 'max:255', 'unique:users'],
            'password' => $this->passwordRules(),
            'terms' => Jetstream::hasTermsAndPrivacyPolicyFeature() ? ['accepted', 'required'] : '',
        ])->validate();

        return User::create([
            'name' => $input['name'],
            'username' => $input['username'],
            'email' => $input['email'],
            'password' => Hash::make($input['password']),
        ]);