app/Http/Controllers/AdminUserController.php

select * from `users` where `users`.`id` = '2' limit 1
---
    public function update(Request $request, $id)
    {
        try{
            $user = User::find($id);