app/Http/Controllers/AdminSongsController.php

    public function create()
    {
        $artists = Artist::all();
        $categories = Category::all();
---
select * from `artists`
select * from `categories`