app/Http/Controllers/ArtistController.php

select * from `artists` where `name` = 'Lios Fonsi' limit 1
insert into `artists` (`name`, `updated_at`, `created_at`) values ('Lios Fonsi', '2023-02-09 19:46:00', '2023-02-09 19:46:00')
---
    public function store(StoreArtistRequest $request)
    {
        try{
            $artist = Artist::where('name', $request->name)->first();
            if(Str::lower($artist->name) === Str::lower($request->name))
                return redirect('admin/artists/create')
                ->with('message', 'Artist already exists!');
        }

        catch(ErrorException $e){
            $artist = new Artist();
            $artist->name = $request->name;
            $artist->save();