app/Http/Controllers/CategoryController.php

select * from `categories` where `name` = 'pop' limit 1
insert into `categories` (`name`, `updated_at`, `created_at`) values ('pop', '2023-02-09 19:46:12', '2023-02-09 19:46:12')
---
    public function store(Request $request)
    {
        try{
            $category = Category::where('name', $request->name)->first();
            if(Str::lower($category->name) === Str::lower($request->name)){
                return response([
                    'type' => 'info',
                    'message' => 'Category already exists!'
                ]);
            }
        }
        catch(ErrorException $e){
            $category = new Category();
            $category->name = $request->name;
            $category->save();