app/Http/Controllers/MusicController.php

select * from `categories`
---
    public function index(MusicDataTable $dataTable)
    {
        if (request()->has('p') && (request('p') != null)){
            $dataTable->setPlaylist(request('p'));
        }

        $categories = Category::all();