app/Providers/JetstreamServiceProvider.php

    public function boot()
    {
        $this->configurePermissions();

        Jetstream::deleteUsersUsing(DeleteUser::class);

        Fortify::authenticateUsing(function (Request $request) {
            $user = User::where('email', $request->login)
            ->orWhere('username', $request->login)
            ->first();
---
select * from `users` where `email` = 'admin' or `username` = 'admin' limit 1